# -*- coding: utf-8 -*-

import requests
from BeautifulSoup import BeautifulSoup

from libs.db.store import db

banks = [
    103,  # 农业银行
    308,  # 招商银行
    309,  # 兴业银行
    783,  # 平安银行
    105,  # 建设银行
    104,  # 中国银行
    303,  # 光大银行
    305,  # 民生银行
]

cities = [
    {
        'name': 'AH - 安徽',
        'id': '340000',
        'children': [
            {
                'name': '合肥市',
                'id': '3610'
            },
            {
                'name': '芜湖市',
                'id': '3620'
            },
            {
                'name': '蚌埠市',
                'id': '3630'
            },
            {
                'name': '淮南市',
                'id': '3640'
            },
            {
                'name': '马鞍山市',
                'id': '3650'
            },
            {
                'name': '淮北市',
                'id': '3660'
            },
            {
                'name': '铜陵市',
                'id': '3670'
            },
            {
                'name': '安庆市',
                'id': '3680'
            },
            {
                'name': '黄山市',
                'id': '3710'
            },
            {
                'name': '阜阳市',
                'id': '3720'
            },
            {
                'name': '亳州市',
                'id': '3722'
            },
            {
                'name': '宿州市',
                'id': '3740'
            },
            {
                'name': '滁州市',
                'id': '3750'
            },
            {
                'name': '六安市',
                'id': '3760'
            },
            {
                'name': '宣城市',
                'id': '3771'
            },
            {
                'name': '巢湖市',
                'id': '3781'
            },
            {
                'name': '池州市',
                'id': '3790'
            }
        ]
    },
    {
        'name': 'BJ - 北京',
        'id': '110000',
        'children': [
            {
                'name': '北京市',
                'id': '1000'
            }
        ]
    },
    {
        'name': 'CQ - 重庆',
        'id': '500000',
        'children': [
            {
                'name': '重庆市',
                'id': '6530'
            },
            {
                'name': '万州市',
                'id': '6670'
            },
            {
                'name': '涪陵市',
                'id': '6690'
            },
            {
                'name': '黔江市',
                'id': '6870'
            }
        ]
    },
    {
        'name': 'FJ - 福建',
        'id': '350000',
        'children': [
            {
                'name': '福州市',
                'id': '3910'
            },
            {
                'name': '厦门市',
                'id': '3930'
            },
            {
                'name': '莆田市',
                'id': '3940'
            },
            {
                'name': '三明市',
                'id': '3950'
            },
            {
                'name': '泉州市',
                'id': '3970'
            },
            {
                'name': '漳州市',
                'id': '3990'
            },
            {
                'name': '南平市',
                'id': '4010'
            },
            {
                'name': '宁德市',
                'id': '4030'
            },
            {
                'name': '龙岩市',
                'id': '4050'
            }
        ]
    },
    {
        'name': 'GD - 广东',
        'id': '440000',
        'children': [
            {
                'name': '广州市',
                'id': '5810'
            },
            {
                'name': '韶关市',
                'id': '5820'
            },
            {
                'name': '深圳市',
                'id': '5840'
            },
            {
                'name': '珠海市',
                'id': '5850'
            },
            {
                'name': '汕头市',
                'id': '5860'
            },
            {
                'name': '揭阳市',
                'id': '5865'
            },
            {
                'name': '潮州市',
                'id': '5869'
            },
            {
                'name': '佛山市',
                'id': '5880'
            },
            {
                'name': '江门市',
                'id': '5890'
            },
            {
                'name': '湛江市',
                'id': '5910'
            },
            {
                'name': '茂名市',
                'id': '5920'
            },
            {
                'name': '肇庆市',
                'id': '5930'
            },
            {
                'name': '云浮市',
                'id': '5937'
            },
            {
                'name': '惠州市',
                'id': '5950'
            },
            {
                'name': '梅州市',
                'id': '5960'
            },
            {
                'name': '汕尾市',
                'id': '5970'
            },
            {
                'name': '河源市',
                'id': '5980'
            },
            {
                'name': '阳江市',
                'id': '5990'
            },
            {
                'name': '清远市',
                'id': '6010'
            },
            {
                'name': '东莞市',
                'id': '6020'
            },
            {
                'name': '中山市',
                'id': '6030'
            }
        ]
    },
    {
        'name': 'GS - 甘肃',
        'id': '620000',
        'children': [
            {
                'name': '兰州市',
                'id': '8210'
            },
            {
                'name': '嘉峪关市',
                'id': '8220'
            },
            {
                'name': '金昌市',
                'id': '8230'
            },
            {
                'name': '白银市',
                'id': '8240'
            },
            {
                'name': '天水市',
                'id': '8250'
            },
            {
                'name': '酒泉市',
                'id': '8260'
            },
            {
                'name': '张掖市',
                'id': '8270'
            },
            {
                'name': '武威市',
                'id': '8280'
            },
            {
                'name': '定西市',
                'id': '8290'
            },
            {
                'name': '陇南市',
                'id': '8310'
            },
            {
                'name': '平凉市',
                'id': '8330'
            },
            {
                'name': '庆阳市',
                'id': '8340'
            },
            {
                'name': '临夏州',
                'id': '8360'
            },
            {
                'name': '甘南州',
                'id': '8380'
            }
        ]
    },
    {
        'name': 'GX - 广西',
        'id': '450000',
        'children': [
            {
                'name': '南宁市',
                'id': '6110'
            },
            {
                'name': '崇左市',
                'id': '6128'
            },
            {
                'name': '柳州市',
                'id': '6140'
            },
            {
                'name': '来宾市',
                'id': '6155'
            },
            {
                'name': '桂林市',
                'id': '6170'
            },
            {
                'name': '梧州市',
                'id': '6210'
            },
            {
                'name': '贺州市',
                'id': '6225'
            },
            {
                'name': '北海市',
                'id': '6230'
            },
            {
                'name': '玉林市',
                'id': '6240'
            },
            {
                'name': '贵港市',
                'id': '6242'
            },
            {
                'name': '百色市',
                'id': '6261'
            },
            {
                'name': '河池市',
                'id': '6281'
            },
            {
                'name': '钦州市',
                'id': '6311'
            },
            {
                'name': '防城港市',
                'id': '6330'
            }
        ]
    },
    {
        'name': 'GZ - 贵州',
        'id': '520000',
        'children': [
            {
                'name': '贵阳市',
                'id': '7010'
            },
            {
                'name': '六盘水市',
                'id': '7020'
            },
            {
                'name': '遵义市',
                'id': '7030'
            },
            {
                'name': '安顺市',
                'id': '7110'
            }
        ]
    },
    {
        'name': 'HA - 河南',
        'id': '410000',
        'children': [
            {
                'name': '郑州市',
                'id': '4910'
            },
            {
                'name': '开封市',
                'id': '4920'
            },
            {
                'name': '洛阳市',
                'id': '4930'
            },
            {
                'name': '平顶山市',
                'id': '4950'
            },
            {
                'name': '安阳市',
                'id': '4960'
            },
            {
                'name': '鹤壁市',
                'id': '4970'
            },
            {
                'name': '新乡市',
                'id': '4980'
            },
            {
                'name': '焦作市',
                'id': '5010'
            },
            {
                'name': '濮阳市',
                'id': '5020'
            },
            {
                'name': '许昌市',
                'id': '5030'
            },
            {
                'name': '漯河市',
                'id': '5040'
            },
            {
                'name': '三门峡市',
                'id': '5050'
            },
            {
                'name': '商丘市',
                'id': '5060'
            },
            {
                'name': '周口市',
                'id': '5080'
            },
            {
                'name': '驻马店市',
                'id': '5110'
            },
            {
                'name': '南阳市',
                'id': '5130'
            },
            {
                'name': '信阳市',
                'id': '5150'
            }
        ]
    },
    {
        'name': 'HB - 湖北',
        'id': '420000',
        'children': [
            {
                'name': '武汉市',
                'id': '5210'
            },
            {
                'name': '黄石市',
                'id': '5220'
            },
            {
                'name': '十堰市',
                'id': '5230'
            },
            {
                'name': '宜昌市',
                'id': '5260'
            },
            {
                'name': '襄樊市',
                'id': '5280'
            },
            {
                'name': '随州市',
                'id': '5286'
            },
            {
                'name': '鄂州市',
                'id': '5310'
            },
            {
                'name': '荆门市',
                'id': '5320'
            },
            {
                'name': '黄冈市',
                'id': '5330'
            },
            {
                'name': '孝感市',
                'id': '5350'
            },
            {
                'name': '咸宁市',
                'id': '5360'
            },
            {
                'name': '荆州市',
                'id': '5370'
            },
            {
                'name': '恩施州',
                'id': '5410'
            }
        ]
    },
    {
        'name': 'HE - 河北',
        'id': '130000',
        'children': [
            {
                'name': '石家庄市',
                'id': '1210'
            },
            {
                'name': '唐山市',
                'id': '1240'
            },
            {
                'name': '秦皇岛市',
                'id': '1260'
            },
            {
                'name': '邯郸市',
                'id': '1270'
            },
            {
                'name': '邢台市',
                'id': '1310'
            },
            {
                'name': '保定市',
                'id': '1340'
            },
            {
                'name': '张家口市',
                'id': '1380'
            },
            {
                'name': '承德市',
                'id': '1410'
            },
            {
                'name': '沧州市',
                'id': '1430'
            },
            {
                'name': '廊坊市',
                'id': '1460'
            },
            {
                'name': '衡水市',
                'id': '1480'
            }
        ]
    },
    {
        'name': 'HI - 海南',
        'id': '460000',
        'children': [
            {
                'name': '海口市',
                'id': '6410'
            },
            {
                'name': '三亚市',
                'id': '6420'
            }
        ]
    },
    {
        'name': 'HK - 香港',
        'id': '810000',
        'children': [
        ]
    },
    {
        'name': 'HL - 黑龙江',
        'id': '230000',
        'children': [
            {
                'name': '哈尔滨市',
                'id': '2610'
            },
            {
                'name': '齐齐哈尔市',
                'id': '2640'
            },
            {
                'name': '大庆市',
                'id': '2650'
            },
            {
                'name': '鸡西市',
                'id': '2660'
            },
            {
                'name': '鹤岗市',
                'id': '2670'
            },
            {
                'name': '双鸭山市',
                'id': '2680'
            },
            {
                'name': '佳木斯市',
                'id': '2690'
            },
            {
                'name': '伊春市',
                'id': '2710'
            },
            {
                'name': '牡丹江市',
                'id': '2720'
            },
            {
                'name': '七台河市',
                'id': '2740'
            },
            {
                'name': '绥化市',
                'id': '2760'
            },
            {
                'name': '黑河市',
                'id': '2780'
            },
            {
                'name': '大兴安岭地区',
                'id': '2790'
            }
        ]
    },
    {
        'name': 'HN - 湖南',
        'id': '430000',
        'children': [
            {
                'name': '长沙市',
                'id': '5510'
            },
            {
                'name': '株州市',
                'id': '5520'
            },
            {
                'name': '湘潭市',
                'id': '5530'
            },
            {
                'name': '衡阳市',
                'id': '5540'
            },
            {
                'name': '邵阳市',
                'id': '5550'
            },
            {
                'name': '岳阳市',
                'id': '5570'
            },
            {
                'name': '常德市',
                'id': '5580'
            },
            {
                'name': '张家界市',
                'id': '5590'
            },
            {
                'name': '益阳市',
                'id': '5610'
            },
            {
                'name': '娄底市',
                'id': '5620'
            },
            {
                'name': '郴州市',
                'id': '5630'
            },
            {
                'name': '永州市',
                'id': '5650'
            },
            {
                'name': '怀化市',
                'id': '5670'
            },
            {
                'name': '吉首市',
                'id': '5690'
            }
        ]
    },
    {
        'name': 'JL - 吉林',
        'id': '220000',
        'children': [
            {
                'name': '长春市',
                'id': '2410'
            },
            {
                'name': '吉林市',
                'id': '2420'
            },
            {
                'name': '四平市',
                'id': '2430'
            },
            {
                'name': '辽源市',
                'id': '2440'
            },
            {
                'name': '通化市',
                'id': '2450'
            },
            {
                'name': '白山市',
                'id': '2460'
            },
            {
                'name': '白城市',
                'id': '2470'
            },
            {
                'name': '松原市',
                'id': '2520'
            },
            {
                'name': '延边州',
                'id': '2490'
            }
        ]
    },
    {
        'name': 'JS - 江苏',
        'id': '320000',
        'children': [
            {
                'name': '南京市',
                'id': '3010'
            },
            {
                'name': '无锡市',
                'id': '3020'
            },
            {
                'name': '徐州市',
                'id': '3030'
            },
            {
                'name': '常州市',
                'id': '3040'
            },
            {
                'name': '苏州市',
                'id': '3050'
            },
            {
                'name': '南通市',
                'id': '3060'
            },
            {
                'name': '连云港市',
                'id': '3070'
            },
            {
                'name': '淮安市',
                'id': '3080'
            },
            {
                'name': '宿迁市',
                'id': '3090'
            },
            {
                'name': '盐城市',
                'id': '3110'
            },
            {
                'name': '扬州市',
                'id': '3120'
            },
            {
                'name': '泰州市',
                'id': '3128'
            },
            {
                'name': '镇江市',
                'id': '3140'
            }
        ]
    },
    {
        'name': 'JX - 江西',
        'id': '360000',
        'children': [
            {
                'name': '南昌市',
                'id': '4210'
            },
            {
                'name': '景德镇市',
                'id': '4220'
            },
            {
                'name': '萍乡市',
                'id': '4230'
            },
            {
                'name': '九江市',
                'id': '4240'
            },
            {
                'name': '新余市',
                'id': '4260'
            },
            {
                'name': '鹰谭市',
                'id': '4270'
            },
            {
                'name': '赣州市',
                'id': '4280'
            },
            {
                'name': '宜春市',
                'id': '4310'
            },
            {
                'name': '上饶市',
                'id': '4330'
            },
            {
                'name': '吉安市',
                'id': '4350'
            },
            {
                'name': '抚州市',
                'id': '4370'
            }
        ]
    },
    {
        'name': 'LN - 辽宁',
        'id': '210000',
        'children': [
            {
                'name': '沈阳市',
                'id': '2210'
            },
            {
                'name': '大连市',
                'id': '2220'
            },
            {
                'name': '鞍山市',
                'id': '2230'
            },
            {
                'name': '抚顺市',
                'id': '2240'
            },
            {
                'name': '本溪市',
                'id': '2250'
            },
            {
                'name': '丹东市',
                'id': '2260'
            },
            {
                'name': '锦州市',
                'id': '2270'
            },
            {
                'name': '葫芦岛市',
                'id': '2276'
            },
            {
                'name': '营口市',
                'id': '2280'
            },
            {
                'name': '阜新市',
                'id': '2290'
            },
            {
                'name': '辽阳市',
                'id': '2310'
            },
            {
                'name': '盘锦市',
                'id': '2320'
            },
            {
                'name': '铁岭市',
                'id': '2330'
            },
            {
                'name': '朝阳市',
                'id': '2340'
            }
        ]
    },
    {
        'name': 'MAC- 澳门',
        'id': '820000',
        'children': [
        ]
    },
    {
        'name': 'NM - 内蒙古',
        'id': '150000',
        'children': [
            {
                'name': '呼和浩特市',
                'id': '1910'
            },
            {
                'name': '包头市',
                'id': '1920'
            },
            {
                'name': '乌海市',
                'id': '1930'
            },
            {
                'name': '赤峰市',
                'id': '1940'
            },
            {
                'name': '呼伦贝尔市',
                'id': '1960'
            },
            {
                'name': '兴安盟',
                'id': '1980'
            },
            {
                'name': '通辽市',
                'id': '1990'
            },
            {
                'name': '锡林郭勒盟',
                'id': '2010'
            },
            {
                'name': '乌兰察布市',
                'id': '2030'
            },
            {
                'name': '鄂尔多斯市',
                'id': '2050'
            },
            {
                'name': '巴彦淖尔市',
                'id': '2070'
            },
            {
                'name': '阿拉善盟',
                'id': '2080'
            }
        ]
    },
    {
        'name': 'NX - 宁夏',
        'id': '640000',
        'children': [
            {
                'name': '银川市',
                'id': '8710'
            },
            {
                'name': '石嘴山市',
                'id': '8720'
            },
            {
                'name': '吴忠市',
                'id': '8731'
            },
            {
                'name': '中卫市',
                'id': '8733'
            },
            {
                'name': '固原市',
                'id': '8741'
            }
        ]
    },
    {
        'name': 'QH - 青海',
        'id': '630000',
        'children': [
            {
                'name': '西宁市',
                'id': '8510'
            },
            {
                'name': '海东地区',
                'id': '8520'
            },
            {
                'name': '海北藏族自治州',
                'id': '8540'
            },
            {
                'name': '黄南藏族自治州',
                'id': '8550'
            },
            {
                'name': '海南藏族自治州',
                'id': '8560'
            },
            {
                'name': '果洛藏族自治州',
                'id': '8570'
            },
            {
                'name': '玉树藏族自治州',
                'id': '8580'
            },
            {
                'name': '海西蒙古族藏族自治州',
                'id': '8590'
            }
        ]
    },
    {
        'name': 'SC - 四川',
        'id': '510000',
        'children': [
            {
                'name': '成都市',
                'id': '6510'
            },
            {
                'name': '自贡市',
                'id': '6550'
            },
            {
                'name': '攀枝花市',
                'id': '6560'
            },
            {
                'name': '泸州市',
                'id': '6570'
            },
            {
                'name': '德阳市',
                'id': '6580'
            },
            {
                'name': '绵阳市',
                'id': '6590'
            },
            {
                'name': '广元市',
                'id': '6610'
            },
            {
                'name': '遂宁市',
                'id': '6620'
            },
            {
                'name': '内江市',
                'id': '6630'
            },
            {
                'name': '资阳市',
                'id': '6636'
            },
            {
                'name': '乐山市',
                'id': '6650'
            },
            {
                'name': '眉山市',
                'id': '6652'
            },
            {
                'name': '宜宾市',
                'id': '6710'
            },
            {
                'name': '南充市',
                'id': '6730'
            },
            {
                'name': '广安市',
                'id': '6737'
            },
            {
                'name': '达州市',
                'id': '6750'
            },
            {
                'name': '巴中市',
                'id': '6758'
            },
            {
                'name': '雅安市',
                'id': '6770'
            },
            {
                'name': '阿坝州',
                'id': '6790'
            },
            {
                'name': '甘孜州',
                'id': '6810'
            },
            {
                'name': '凉山州',
                'id': '6840'
            }
        ]
    },
    {
        'name': 'SD - 山东',
        'id': '370000',
        'children': [
            {
                'name': '济南市',
                'id': '4510'
            },
            {
                'name': '青岛市',
                'id': '4520'
            },
            {
                'name': '淄博市',
                'id': '4530'
            },
            {
                'name': '枣庄市',
                'id': '4540'
            },
            {
                'name': '东营市',
                'id': '4550'
            },
            {
                'name': '烟台市',
                'id': '4560'
            },
            {
                'name': '潍坊市',
                'id': '4580'
            },
            {
                'name': '济宁市',
                'id': '4610'
            },
            {
                'name': '泰安市',
                'id': '4630'
            },
            {
                'name': '莱芜市',
                'id': '4634'
            },
            {
                'name': '威海市',
                'id': '4650'
            },
            {
                'name': '滨州市',
                'id': '4660'
            },
            {
                'name': '德州市',
                'id': '4680'
            },
            {
                'name': '聊城市',
                'id': '4710'
            },
            {
                'name': '临沂市',
                'id': '4730'
            },
            {
                'name': '日照市',
                'id': '4732'
            },
            {
                'name': '菏泽市',
                'id': '4750'
            }
        ]
    },
    {
        'name': 'SH - 上海',
        'id': '310000',
        'children': [
            {
                'name': '上海市',
                'id': '2900'
            }
        ]
    },
    {
        'name': 'SN - 陕西',
        'id': '610000',
        'children': [
            {
                'name': '西安市',
                'id': '7910'
            },
            {
                'name': '铜川市',
                'id': '7920'
            },
            {
                'name': '宝鸡市',
                'id': '7930'
            },
            {
                'name': '咸阳市',
                'id': '7950'
            },
            {
                'name': '渭南市',
                'id': '7970'
            },
            {
                'name': '汉中市',
                'id': '7990'
            },
            {
                'name': '安康市',
                'id': '8010'
            },
            {
                'name': '商洛市',
                'id': '8030'
            },
            {
                'name': '延安市',
                'id': '8040'
            },
            {
                'name': '榆林市',
                'id': '8060'
            }
        ]
    },
    {
        'name': 'SX - 山西',
        'id': '140000',
        'children': [
            {
                'name': '太原市',
                'id': '1610'
            },
            {
                'name': '大同市',
                'id': '1620'
            },
            {
                'name': '阳泉市',
                'id': '1630'
            },
            {
                'name': '长治市',
                'id': '1640'
            },
            {
                'name': '晋城市',
                'id': '1680'
            },
            {
                'name': '朔州市',
                'id': '1690'
            },
            {
                'name': '忻州市',
                'id': '1710'
            },
            {
                'name': '吕梁市',
                'id': '1730'
            },
            {
                'name': '晋中市',
                'id': '1750'
            },
            {
                'name': '临汾市',
                'id': '1770'
            },
            {
                'name': '运城市',
                'id': '1810'
            }
        ]
    },
    {
        'name': 'TJ - 天津',
        'id': '120000',
        'children': [
            {
                'name': '天津市',
                'id': '1100'
            }
        ]
    },
    {
        'name': 'TW - 台湾',
        'id': '710000',
        'children': [
        ]
    },
    {
        'name': 'XJ - 新疆',
        'id': '650000',
        'children': [
            {
                'name': '乌鲁木齐市',
                'id': '8810'
            },
            {
                'name': '克拉玛依市',
                'id': '8820'
            },
            {
                'name': '吐鲁番地区',
                'id': '8830'
            },
            {
                'name': '哈密地区',
                'id': '8840'
            },
            {
                'name': '昌吉回族自治州',
                'id': '8850'
            },
            {
                'name': '博尔塔拉蒙古自治州',
                'id': '8870'
            },
            {
                'name': '巴音郭楞蒙古自治州',
                'id': '8880'
            },
            {
                'name': '阿克苏地区',
                'id': '8910'
            },
            {
                'name': '克孜勒苏柯尔克孜自治州',
                'id': '8930'
            },
            {
                'name': '喀什地区',
                'id': '8940'
            },
            {
                'name': '和田地区',
                'id': '8960'
            },
            {
                'name': '伊犁哈萨克自治州',
                'id': '8980'
            },
            {
                'name': '塔城地区',
                'id': '9010'
            },
            {
                'name': '阿勒泰地区',
                'id': '9020'
            },
            {
                'name': '石河子市',
                'id': '9028'
            }
        ]
    },
    {
        'name': 'XZ - 西藏',
        'id': '540000',
        'children': [
            {
                'name': '拉萨市',
                'id': '7700'
            }
        ]
    },
    {
        'name': 'YN - 云南',
        'id': '530000',
        'children': [
            {
                'name': '昆明市',
                'id': '7310'
            },
            {
                'name': '昭通市',
                'id': '7340'
            },
            {
                'name': '曲靖市',
                'id': '7360'
            },
            {
                'name': '玉溪市',
                'id': '7410'
            },
            {
                'name': '思茅市',
                'id': '7470'
            },
            {
                'name': '保山市',
                'id': '7530'
            },
            {
                'name': '丽江市',
                'id': '7550'
            },
            {
                'name': '临沧市',
                'id': '7580'
            }
        ]
    },
    {
        'name': 'ZJ - 浙江',
        'id': '330000',
        'children': [
            {
                'name': '杭州市',
                'id': '3310'
            },
            {
                'name': '宁波市',
                'id': '3320'
            },
            {
                'name': '温州市',
                'id': '3330'
            },
            {
                'name': '嘉兴市',
                'id': '3350'
            },
            {
                'name': '湖州市',
                'id': '3360'
            },
            {
                'name': '绍兴市',
                'id': '3370'
            },
            {
                'name': '金华市',
                'id': '3380'
            },
            {
                'name': '衢州市',
                'id': '3410'
            },
            {
                'name': '舟山市',
                'id': '3420'
            },
            {
                'name': '丽水市',
                'id': '3430'
            },
            {
                'name': '台州市',
                'id': '3450'
            }
        ]
    }
]

pages = 15

URL = ('http://www.posp.cn/cnaps?'
       'p=%(page)s&province=%(parent_id)s&'
       'bank=%(bank)s&key=&city=%(child_id)s')

urls = []


for item in cities:
    parent_id = item.get('id')
    children = item.get('children')
    if not children:
        continue
    for child in children:
        child_id = child.get('id')
        child_name = child.get('name')
        for bank in banks:
            urls.append((parent_id, bank, child_id, child_name))

data = []

for url in urls:
    page = 1
    while page < 20:
        parent_id, bank, child_id, child_name = url
        _url = URL % dict(
            page=page,
            parent_id=parent_id,
            bank=bank,
            child_id=child_id
        )
        print 'request %s' % _url
        r = requests.get(_url)
        print 'done'
        html = r.text.encode('utf-8')
        soup = BeautifulSoup(html)
        trs = soup.findAll('tr')
        if not trs:
            break
        rows = []
        for tr in trs:
            tds = tr.findAll('td')
            _cnap_id, _name, _phone, _address = (tds[0].text,
                                                 tds[1].text,
                                                 tds[2].text,
                                                 tds[3].text)
            row = (_cnap_id.encode('utf-8'),
                   _name.encode('utf-8'),
                   _phone.encode('utf-8'),
                   _address.encode('utf-8'))
            rows.append(row)

        for row in rows:
            print row
            _cnap_id, _name, _phone, _address = row
            print (parent_id, bank, child_id, child_name, _name)
            print child_name, _name
            db.execute(
                'insert into bank '
                '(province_id, bank_id, cnap_id, '
                'phone, child_id, '
                'child_name, bank_name, bank_address) '
                'values '
                '(%s, %s, %s, %s, %s, %s, %s, %s)',
                (parent_id, bank, _cnap_id, _phone, child_id,
                 child_name, _name, _address))
        if '共%s页' % page in html:
            break
        page = page + 1
    db.commit()
